# parameters
nc: 2  # number of classes
n_segcls: 5 # 分割类别数
n_cls: 2
depth_1: 5           # backbone1的深度
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone1:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]], # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
  ]

backbone2:
  [[-1, 1, Focus, [64, 3]],  # 5
   [-1, 1, Conv, [128, 3, 2]],  # 6
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 8
   [-1, 9, C3, [256]],
   [[-1, 4], 1, CAFuse, [256]],  # 10
   [-1, 1, RGB, [256]],
   [10, 1, Depth, [256]],
   [10, 1, PointwiseConv, [256]],   # 13 Concat
   [11, 1, Conv, [512, 3, 2]],       # 14 rgb-conv
   [-1, 9, C3, [512]],              # 15 rgb-c3
   [12, 1, Conv, [512, 3, 2]],  # 16
   [-1, 9, C3, [512]],
   [[-1, 15], 1, CAFuse, [512]],  # 18
   [-1, 1, RGB, [512]],
   [18, 1, Depth, [512]],
   [18, 1, PointwiseConv, [512]],   # 21 Concat
   [19, 1, Conv, [1024, 3, 2]],     # 22 rgb-conv
   [-1, 3, C3, [1024]],             # 23 rgb-c3
   [20, 1, Conv, [1024, 3, 2]],  # 24
   [-1, 3, C3, [1024]],
   [[-1, 23], 1, CAFusion, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 27
  ]

# YOLOv5 head
head:
  [[-1, 1, Classify, [2]],     #28
   [27, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 21], 1, Concat, [1]],  # cat backbone P4  # PANet是add, yolov5是concat
   [-1, 3, C3, [512, False]],  # 32

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 13], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 36 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 33], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 39 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 29], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 42 (P5/32-large)

   [[35, 38, 41], 1, SegMaskPSP, [n_segcls, 3, 256, False]],  # 语义分割头通道配置256

   [[36, 39, 42], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)  必须在最后一层, 原代码很多默认了Detect是最后, 并没有全改
  ]
